# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap "homebrew/core"
tap 'homebrew/cask-versions'
tap "homebrew/services"
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'git'
brew 'grep'
brew 'jq' 
brew 'mas'
brew 'golangci-lint'
brew 'podman-desktop'
brew 'certigo'
brew 'go'
brew 'node'
brew 'yarn'
brew 'nvm'
brew 'make'
brew 'derailed/k9s/k9s'
brew 'poetry'

# Apps
# cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'
cask 'notion'
cask 'postman'
cask 'time-out'
cask 'rectangle'
cask 'talon'

# Fonts
# e.g.
# cask 'font-source-serif-pro'

# Mac App Store
# e.g. 
# mas 'Giphy Capture', id: 668208984
