# Binaries
brew 'awscli'
brew 'git'
brew 'grep'
brew 'jq'
brew 'mas'
brew 'golangci-lint'
brew 'go'
brew 'node'
brew 'yarn'

# Runtime / tooling
brew 'colima'
brew 'docker'
brew 'nvm'
brew 'make'
brew 'poetry'

# Apps
# cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'
cask 'postman'
cask 'talon'
